ahtn/keyplus/ports/efm8/efm8/mcu/EFM8SB1/inc/SI_EFM8SB1_Register_Enums.h
#define CS0CF_CS0CM__FMASK                0x70 ///< CS0 Start of Conversion Mode Select               
#define CS0CF_CS0CM__SHIFT                0x04 ///< CS0 Start of Conversion Mode Select               
#define CS0CF_CS0CM__CS0BUSY              0x00 ///< Conversion initiated on every write of 1 to       
                                               ///< CS0BUSY.                                          
#define CS0CF_CS0CM__TIMER0               0x10 ///< Conversion initiated on overflow of Timer 0.      
#define CS0CF_CS0CM__TIMER2               0x20 ///< Conversion initiated on overflow of Timer 2.      
#define CS0CF_CS0CM__TIMER1               0x30 ///< Conversion initiated on overflow of Timer 1.      
#define CS0CF_CS0CM__TIMER3               0x40 ///< Conversion initiated on overflow of Timer 3.      
#define CS0CF_CS0CM__SINGLE_SCAN          0x50 ///< When CS0SMEN is set to 1, the converter completes 
                                               ///< a Single Scan of the channels selected by         
                                               ///< CS0SCAN0/1. This setting is invalid when CS0SMEN  
                                               ///< is cleared to 0.                                  
#define CS0CF_CS0CM__SINGLE_CONTINUOUS    0x60 ///< Conversion initiated continuously on the channel  
                                               ///< selected by CS0MX after writing 1 to CS0BUSY.     
#define CS0CF_CS0CM__AUTO_SCAN            0x70 ///< When CS0SMEN is set to 1, the converter enters    
                                               ///< Auto Scan Mode and continuously scans the channels
                                               ///< selected by CS0SCAN0/1. When CS0SMEN is cleared to
                                               ///< 0, the converter scans continuously on channels   
                                               ///< from CS0SS to CS0SE after firmware writes 1 to    
                                               ///< CS0BUSY.                                          
                                                                                                      
#define CS0CF_CS0SMEN__BMASK              0x80 ///< CS0 Channel Scan Masking Enable                   
#define CS0CF_CS0SMEN__SHIFT              0x07 ///< CS0 Channel Scan Masking Enable                   
#define CS0CF_CS0SMEN__SCAN_MASK_DISABLED 0x00 ///< The CS0SCAN0 and CS0SCAN1 register contents are   
                                               ///< ignored.                                          
#define CS0CF_CS0SMEN__SCAN_MASK_ENABLED  0x80 ///< The CS0SCAN0 and CS0SCAN1 registers determine     
                                               ///< which channels will be included in the scan.      
                                                                                                      
//------------------------------------------------------------------------------
// CS0CN0 Enums (Capacitive Sense 0 Control @ 0xB0)
//------------------------------------------------------------------------------
#define CS0CN0_CSCMPF__BMASK     0x01 ///< CS0 Digital Comparator Interrupt Flag             
#define CS0CN0_CSCMPF__SHIFT     0x00 ///< CS0 Digital Comparator Interrupt Flag             
#define CS0CN0_CSCMPF__NOT_SET   0x00 ///< CS0 result is smaller than the value set by CS0THH
                                      ///< and CS0THL since the last time CS0CMPF was        
                                      ///< cleared.                                          
#define CS0CN0_CSCMPF__SET       0x01 ///< CS0 result is greater than the value set by CS0THH
                                      ///< and CS0THL since the last time CS0CMPF was        
                                      ///< cleared.                                          
                                                                                             
#define CS0CN0_CSPME__BMASK      0x02 ///< CS0 Pin Monitor Event                             
#define CS0CN0_CSPME__SHIFT      0x01 ///< CS0 Pin Monitor Event                             
#define CS0CN0_CSPME__NO_RETRIES 0x00 ///< Converter re-tries have not occurred.             
#define CS0CN0_CSPME__RETRIES    0x02 ///< Converter re-tries occurred.                      
                                                                                             
#define CS0CN0_CSCMPEN__BMASK    0x08 ///< CS0 Digital Comparator Enable                     
#define CS0CN0_CSCMPEN__SHIFT    0x03 ///< CS0 Digital Comparator Enable                     
#define CS0CN0_CSCMPEN__DISABLED 0x00 ///< Disable CS0 digital comparator.                   
#define CS0CN0_CSCMPEN__ENABLED  0x08 ///< Enable CS0 digital comparator.                    
                                                                                             
#define CS0CN0_CSBUSY__BMASK     0x10 ///< CS0 Busy                                          
#define CS0CN0_CSBUSY__SHIFT     0x04 ///< CS0 Busy                                          
#define CS0CN0_CSBUSY__NOT_SET   0x00 ///< A CS0 conversion is not currently in progress.    
#define CS0CN0_CSBUSY__SET       0x10 ///< CS0 conversion is in progress or start a CS0      
                                      ///< conversion.                                       
                                                                                             
#define CS0CN0_CSINT__BMASK      0x20 ///< CS0 Interrupt Flag                                
#define CS0CN0_CSINT__SHIFT      0x05 ///< CS0 Interrupt Flag                                
#define CS0CN0_CSINT__NOT_SET    0x00 ///< CS0 has not completed a data conversion since the 
                                      ///< last time CS0INT was cleared.                     
#define CS0CN0_CSINT__SET        0x20 ///< CS0 has completed a data conversion.              
                                                                                             
#define CS0CN0_CSEOS__BMASK      0x40 ///< CS0 End of Scan Interrupt Flag                    
#define CS0CN0_CSEOS__SHIFT      0x06 ///< CS0 End of Scan Interrupt Flag                    
#define CS0CN0_CSEOS__NOT_SET    0x00 ///< CS0 has not completed a scan since the last time  
                                      ///< CS0EOS was cleared.                               
#define CS0CN0_CSEOS__SET        0x40 ///< CS0 has completed a scan.                         
                                                                                             
#define CS0CN0_CSEN__BMASK       0x80 ///< CS0 Enable                                        
#define CS0CN0_CSEN__SHIFT       0x07 ///< CS0 Enable                                        
#define CS0CN0_CSEN__DISABLED    0x00 ///< CS0 disabled and in low-power mode.               
#define CS0CN0_CSEN__ENABLED     0x80 ///< CS0 enabled and ready to convert.                 
                                                                                             
//------------------------------------------------------------------------------
// CS0DH Enums (Capacitive Sense 0 Data High Byte @ 0xEE)
//------------------------------------------------------------------------------
#define CS0DH_CS0DH__FMASK 0xFF ///< CS0 Data High Byte
#define CS0DH_CS0DH__SHIFT 0x00 ///< CS0 Data High Byte
                                                       
//------------------------------------------------------------------------------
// CS0DL Enums (Capacitive Sense 0 Data Low Byte @ 0xED)
//------------------------------------------------------------------------------
#define CS0DL_CS0DL__FMASK 0xFF ///< CS0 Data Low Byte
#define CS0DL_CS0DL__SHIFT 0x00 ///< CS0 Data Low Byte
                                                      
//------------------------------------------------------------------------------
// CS0MD1 Enums (Capacitive Sense 0 Mode 1 @ 0xAF)
//------------------------------------------------------------------------------
#define CS0MD1_CS0CG__FMASK                 0x07 ///< CS0 Capacitance Gain Select                       
#define CS0MD1_CS0CG__SHIFT                 0x00 ///< CS0 Capacitance Gain Select                       
#define CS0MD1_CS0CG__GAIN_1                0x00 ///< Gain = 1x                                         
#define CS0MD1_CS0CG__GAIN_2                0x01 ///< Gain = 2x                                         
#define CS0MD1_CS0CG__GAIN_3                0x02 ///< Gain = 3x                                         
#define CS0MD1_CS0CG__GAIN_4                0x03 ///< Gain = 4x                                         
#define CS0MD1_CS0CG__GAIN_5                0x04 ///< Gain = 5x                                         
#define CS0MD1_CS0CG__GAIN_6                0x05 ///< Gain = 6x                                         
#define CS0MD1_CS0CG__GAIN_7                0x06 ///< Gain = 7x                                         
#define CS0MD1_CS0CG__GAIN_8                0x07 ///< Gain = 8x                                         
                                                                                                        
#define CS0MD1_CS0WOI__BMASK                0x08 ///< CS0 Wake on Interrupt Configuration               
#define CS0MD1_CS0WOI__SHIFT                0x03 ///< CS0 Wake on Interrupt Configuration               
#define CS0MD1_CS0WOI__COMPARATOR_ONLY      0x00 ///< Wake-up event generated on digital comparator     
                                                 ///< interrupt only.                                   
#define CS0MD1_CS0WOI__EOS_OR_COMPARATOR    0x08 ///< Wake-up event generated on end of scan or digital 
                                                 ///< comparator interrupt.                             
                                                                                                        
#define CS0MD1_CS0DR__FMASK                 0x30 ///< CS0 Double Reset Select                           
#define CS0MD1_CS0DR__SHIFT                 0x04 ///< CS0 Double Reset Select                           
#define CS0MD1_CS0DR__DOUBLE_RESET_DISABLED 0x00 ///< No additional time is used for secondary reset.   
#define CS0MD1_CS0DR__ADD_0P75              0x10 ///< An additional 0.75 us is used for secondary reset.
#define CS0MD1_CS0DR__ADD_1P5               0x20 ///< An additional 1.5 us is used for secondary reset. 
#define CS0MD1_CS0DR__ADD_2P25              0x30 ///< An additional 2.25 us is used for secondary reset.
                                                                                                        
