ahtn/keyplus/ports/efm8/efm8/mcu/EFM8SB1/inc/SI_EFM8SB1_Register_Enums.h
#define CS0MD1_CS0POL__BMASK                0x40 ///< CS0 Digital Comparator Polarity Select            
#define CS0MD1_CS0POL__SHIFT                0x06 ///< CS0 Digital Comparator Polarity Select            
#define CS0MD1_CS0POL__GREATER_THAN         0x00 ///< The digital comparator generates an interrupt if  
                                                 ///< the conversion is greater than the threshold.     
#define CS0MD1_CS0POL__LESS_THAN_OR_EQUAL   0x40 ///< The digital comparator generates an interrupt if  
                                                 ///< the conversion is less than or equal to the       
                                                 ///< threshold.                                        
                                                                                                        
//------------------------------------------------------------------------------
// CS0MD2 Enums (Capacitive Sense 0 Mode 2 @ 0xF3)
//------------------------------------------------------------------------------
#define CS0MD2_CS0IA__FMASK           0x07 ///< CS0 Output Current Adjustment                     
#define CS0MD2_CS0IA__SHIFT           0x00 ///< CS0 Output Current Adjustment                     
#define CS0MD2_CS0IA__CURRENT_MODE0   0x00 ///< Full current.                                     
#define CS0MD2_CS0IA__CURRENT_MODE1   0x01 ///< 1/8 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE2   0x02 ///< 1/4 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE3   0x03 ///< 3/8 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE4   0x04 ///< 1/2 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE5   0x05 ///< 5/8 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE6   0x06 ///< 3/4 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE7   0x07 ///< 7/8 current.                                      
                                                                                                  
#define CS0MD2_CS0DT__FMASK           0x38 ///< CS0 Discharge Time                                
#define CS0MD2_CS0DT__SHIFT           0x03 ///< CS0 Discharge Time                                
#define CS0MD2_CS0DT__DISCHARGE_MODE0 0x00 ///< Discharge time is 0.75 us (recommended for most   
                                           ///< switches).                                        
#define CS0MD2_CS0DT__DISCHARGE_MODE1 0x08 ///< Discharge time is 1.0 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE2 0x10 ///< Discharge time is 1.2 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE3 0x18 ///< Discharge time is 1.5 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE4 0x20 ///< Discharge time is 2 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE5 0x28 ///< Discharge time is 3 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE6 0x30 ///< Discharge time is 6 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE7 0x38 ///< Discharge time is 12 us.                          
                                                                                                  
#define CS0MD2_CS0CR__FMASK           0xC0 ///< CS0 Conversion Rate                               
#define CS0MD2_CS0CR__SHIFT           0x06 ///< CS0 Conversion Rate                               
#define CS0MD2_CS0CR__12_BITS         0x00 ///< Conversions last 12 internal CS0 clocks and are 12
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__13_BITS         0x40 ///< Conversions last 13 internal CS0 clocks and are 13
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__14_BITS         0x80 ///< Conversions last 14 internal CS0 clocks and are 14
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__16_BITS         0xC0 ///< Conversions last 16 internal CS0 clocks.and are 16
                                           ///< bits in length.                                   
                                                                                                  
//------------------------------------------------------------------------------
// CS0MD3 Enums (Capacitive Sense 0 Mode 3 @ 0xF3)
//------------------------------------------------------------------------------
#define CS0MD3_CS0LP__FMASK      0x07 ///< CS0 Low Pass Filter Selection        
#define CS0MD3_CS0LP__SHIFT      0x00 ///< CS0 Low Pass Filter Selection        
                                                                                
#define CS0MD3_CS0RP__FMASK      0x18 ///< CS0 Ramp Selection                   
#define CS0MD3_CS0RP__SHIFT      0x03 ///< CS0 Ramp Selection                   
#define CS0MD3_CS0RP__RAMP_MODE0 0x00 ///< Ramp time is less than 1.5 us.       
#define CS0MD3_CS0RP__RAMP_MODE1 0x08 ///< Ramp time is between 1.5 us and 3 us.
#define CS0MD3_CS0RP__RAMP_MODE2 0x10 ///< Ramp time is between 3 us and 6 us.  
#define CS0MD3_CS0RP__RAMP_MODE3 0x18 ///< Ramp time is greater than 6 us.      
                                                                                
//------------------------------------------------------------------------------
// CS0MX Enums (Capacitive Sense 0 Mux Channel Select @ 0xAB)
//------------------------------------------------------------------------------
#define CS0MX_CS0MX__FMASK  0x0F ///< CS0 Mux Channel Select
#define CS0MX_CS0MX__SHIFT  0x00 ///< CS0 Mux Channel Select
#define CS0MX_CS0MX__CS0P0  0x00 ///< Select CS0.0.         
#define CS0MX_CS0MX__CS0P1  0x01 ///< Select CS0.1.         
#define CS0MX_CS0MX__CS0P2  0x02 ///< Select CS0.2.         
#define CS0MX_CS0MX__CS0P3  0x03 ///< Select CS0.3.         
#define CS0MX_CS0MX__CS0P4  0x04 ///< Select CS0.4.         
#define CS0MX_CS0MX__CS0P5  0x05 ///< Select CS0.5.         
#define CS0MX_CS0MX__CS0P6  0x06 ///< Select CS0.6.         
#define CS0MX_CS0MX__CS0P7  0x07 ///< Select CS0.7.         
#define CS0MX_CS0MX__CS0P8  0x08 ///< Select CS0.8.         
#define CS0MX_CS0MX__CS0P9  0x09 ///< Select CS0.9.         
#define CS0MX_CS0MX__CS0P10 0x0A ///< Select CS0.10.        
#define CS0MX_CS0MX__CS0P11 0x0B ///< Select CS0.11.        
#define CS0MX_CS0MX__CS0P12 0x0C ///< Select CS0.12.        
#define CS0MX_CS0MX__CS0P13 0x0D ///< Select CS0.13.        
#define CS0MX_CS0MX__NONE   0x0F ///< No input selected.    
                                                            
//------------------------------------------------------------------------------
// CS0PM Enums (Capacitive Sense 0 Pin Monitor @ 0xDE)
//------------------------------------------------------------------------------
#define CS0PM_CSPMMD__FMASK                 0x03 ///< CS0 Pin Monitor Mode                             
#define CS0PM_CSPMMD__SHIFT                 0x00 ///< CS0 Pin Monitor Mode                             
#define CS0PM_CSPMMD__ALWAYS_RETRY          0x00 ///< Always retry bit cycles on a pin state change.   
#define CS0PM_CSPMMD__RETRY_TWO_TIMES       0x01 ///< Retry up to twice on consecutive bit cycles.     
#define CS0PM_CSPMMD__RETRY_FOUR_TIMES      0x02 ///< Retry up to four times on consecutive bit cycles.
                                                                                                       
#define CS0PM_CP0PM__BMASK                  0x04 ///< CP0 Pin Monitor Enable                           
#define CS0PM_CP0PM__SHIFT                  0x02 ///< CP0 Pin Monitor Enable                           
#define CS0PM_CP0PM__CMP_MONITOR_DISABLED   0x00 ///< Disable monitoring on the CP0 output.            
#define CS0PM_CP0PM__CMP_MONITOR_ENABLED    0x04 ///< Enable monitoring on the CP0 output.             
                                                                                                       
#define CS0PM_PIOPM__BMASK                  0x08 ///< Port I/O Pin Monitor Enable                      
#define CS0PM_PIOPM__SHIFT                  0x03 ///< Port I/O Pin Monitor Enable                      
#define CS0PM_PIOPM__PORT_MONITOR_DISABLED  0x00 ///< Disable monitoring of writes to the port latches.
#define CS0PM_PIOPM__PORT_MONITOR_ENABLED   0x08 ///< Enable monitoring of writes to the port latches. 
                                                                                                       
#define CS0PM_PCAPM__BMASK                  0x10 ///< PCA Pin Monitor Enable                           
#define CS0PM_PCAPM__SHIFT                  0x04 ///< PCA Pin Monitor Enable                           
#define CS0PM_PCAPM__PCA_MONITOR_DISABLED   0x00 ///< Disable monitoring on the PCA output pins.       
#define CS0PM_PCAPM__PCA_MONITOR_ENABLED    0x10 ///< Enable monitoring on the PCA output pins.        
                                                                                                       
#define CS0PM_SMBPM__BMASK                  0x20 ///< SMBus Pin Monitor Enable                         
#define CS0PM_SMBPM__SHIFT                  0x05 ///< SMBus Pin Monitor Enable                         
#define CS0PM_SMBPM__SMBUS_MONITOR_DISABLED 0x00 ///< Disable monitoring on the SMBus pins.            
#define CS0PM_SMBPM__SMBUS_MONITOR_ENABLED  0x20 ///< Enable monitoring on the SMBus pins.             
                                                                                                       
#define CS0PM_SPIPM__BMASK                  0x40 ///< SPI Pin Monitor Enable                           
#define CS0PM_SPIPM__SHIFT                  0x06 ///< SPI Pin Monitor Enable                           
#define CS0PM_SPIPM__SPI_MONITOR_DISABLED   0x00 ///< Disable monitoring on the SPI output pins.       
#define CS0PM_SPIPM__SPI_MONITOR_ENABLED    0x40 ///< Enable monitoring on the SPI output pins.        
                                                                                                       
#define CS0PM_UAPM__BMASK                   0x80 ///< UART Pin Monitor Enable                          
#define CS0PM_UAPM__SHIFT                   0x07 ///< UART Pin Monitor Enable                          
#define CS0PM_UAPM__UART_MONITOR_DISABLED   0x00 ///< Disable monitoring on the UART TX pin.           
#define CS0PM_UAPM__UART_MONITOR_ENABLED    0x80 ///< Enable monitoring on the UART TX pin.            
                                                                                                       
//------------------------------------------------------------------------------
// CS0SCAN0 Enums (Capacitive Sense 0 Channel Scan Mask 0 @ 0xD2)
//------------------------------------------------------------------------------
#define CS0SCAN0_CS0SCAN0__FMASK 0xFF ///< Channel Scan Mask for Port 0
#define CS0SCAN0_CS0SCAN0__SHIFT 0x00 ///< Channel Scan Mask for Port 0
                                                                       
//------------------------------------------------------------------------------
// CS0SCAN1 Enums (Capacitive Sense 0 Channel Scan Mask 1 @ 0xD3)
//------------------------------------------------------------------------------
#define CS0SCAN1_CS0SCAN1__FMASK 0x3F ///< Channel Scan Mask for Port 1
#define CS0SCAN1_CS0SCAN1__SHIFT 0x00 ///< Channel Scan Mask for Port 1
                                                                       
//------------------------------------------------------------------------------
// CS0SE Enums (Capacitive Sense 0 Auto Scan End Channel @ 0xDE)
//------------------------------------------------------------------------------
#define CS0SE_CS0SE__FMASK 0x1F ///< Ending Channel for Auto Scan
#define CS0SE_CS0SE__SHIFT 0x00 ///< Ending Channel for Auto Scan
                                                                 
//------------------------------------------------------------------------------
// CS0SS Enums (Capacitive Sense 0 Auto Scan Start Channel @ 0xDD)
//------------------------------------------------------------------------------
#define CS0SS_CS0SS__FMASK 0x1F ///< Starting Channel for Auto Scan
#define CS0SS_CS0SS__SHIFT 0x00 ///< Starting Channel for Auto Scan
                                                                   
//------------------------------------------------------------------------------
// CS0THH Enums (Capacitive Sense 0 Comparator Threshold High Byte @ 0xFE)
//------------------------------------------------------------------------------
#define CS0THH_CS0THH__FMASK 0xFF ///< CS0 Comparator Threshold High Byte
#define CS0THH_CS0THH__SHIFT 0x00 ///< CS0 Comparator Threshold High Byte
                                                                         
//------------------------------------------------------------------------------
// CS0THL Enums (Capacitive Sense 0 Comparator Threshold Low Byte @ 0xFD)
//------------------------------------------------------------------------------
#define CS0THL_CS0THL__FMASK 0xFF ///< CS0 Comparator Threshold Low Byte
#define CS0THL_CS0THL__SHIFT 0x00 ///< CS0 Comparator Threshold Low Byte
                                                                        
//------------------------------------------------------------------------------
// DERIVID Enums (Device Identification @ 0xE3)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK              0xFF ///< Derivative ID          
#define DERIVID_DERIVID__SHIFT              0x00 ///< Derivative ID          
#define DERIVID_DERIVID__EFM8SB10F8G_QFN24  0x01 ///< EFM8SB10F8G-{R}-QFN24. 
#define DERIVID_DERIVID__EFM8SB10F8G_QSOP24 0x02 ///< EFM8SB10F8G-{R}-QSOP24.
#define DERIVID_DERIVID__EFM8SB10F8G_QFN20  0x03 ///< EFM8SB10F8G-{R}-QFN20. 
#define DERIVID_DERIVID__EFM8SB10F4G_QFN20  0x06 ///< EFM8SB10F4G-{R}-QFN20. 
#define DERIVID_DERIVID__EFM8SB10F2G_QFN20  0x09 ///< EFM8SB10F2G-{R}-QFN20. 
                                                                             
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xE2)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x00 ///< Revision A 
                                                
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
